Revit 2027 API
CompoundStructure.EndCap Property
 Indicates the end cap condition defining which shell layers will participate in end wrapping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EndCapCondition EndCap { get; set; }
Public Property EndCap As EndCapCondition
	Get
	Set
public:
property EndCapCondition EndCap {
	EndCapCondition get ();
	void set (EndCapCondition value);
}
member EndCap : EndCapCondition with get, set
Property Value
EndCapCondition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace